akupila/stm32f401C-template/lib/STM32F401-Discovery_FW_V1.0.0/Utilities/STM32F401-Discovery/stm32f401_discovery_lsm303dlhc.c
  /* Write value to Mag MEMS CRA_REG regsister */
  LSM303DLHC_Write(MAG_I2C_ADDRESS, LSM303DLHC_CRA_REG_M, 1, &cra_regm);
  
  /* Write value to Mag MEMS CRB_REG regsister */
  LSM303DLHC_Write(MAG_I2C_ADDRESS, LSM303DLHC_CRB_REG_M, 1, &crb_regm);

  /* Write value to Mag MEMS MR_REG regsister */
  LSM303DLHC_Write(MAG_I2C_ADDRESS, LSM303DLHC_MR_REG_M, 1, &mr_regm);
}

/**
  * @brief  Get status for Mag LSM303DLHC data
  * @param  None         
  * @retval Data status in a LSM303DLHC Data register
  */
uint8_t LSM303DLHC_MagGetDataStatus(void)
{
  uint8_t tmpreg;
  
  /* Read Mag STATUS register */
  LSM303DLHC_Read(MAG_I2C_ADDRESS, LSM303DLHC_SR_REG_M, 1, &tmpreg);
                  
  return tmpreg;
}

/**
  * @brief  Reads a block of data from the LSM303DLHC.
  * @param  DeviceAddr : specifies the slave address to be programmed(ACC_I2C_ADDRESS or MAG_I2C_ADDRESS).
  * @param  RegisterAddr : specifies the LSM303DLHC internal address register to read from.
  * @param  NumByteToRead : number of bytes to read from the LSM303DLH ( NumByteToRead >1  only for the Mgnetometer readinf).
  * @param  pBuffer : pointer to the buffer that receives the data read from the LSM303DLH.
  * @retval LSM303DLHC register value
  */
uint16_t LSM303DLHC_Read(uint8_t DeviceAddr, uint8_t RegisterAddr,
                              uint16_t NumByteToRead,
                              uint8_t* pBuffer)
{
  __IO uint32_t LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
  __IO uint32_t temp;
  
  LSM303DLHC_I2C_Config();
  
restart:
  
  LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
/* Send START condition */
  I2C_GenerateSTART(LSM303DLHC_I2C, ENABLE);
  /* Test on EV5 and clear it */
  while (!I2C_CheckEvent(LSM303DLHC_I2C, I2C_EVENT_MASTER_MODE_SELECT))
  {
    if (LSM303DLHC_Timeout-- == 0)
      return ERROR;
  }
     
  LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
  /* Send slave address for read */
  I2C_Send7bitAddress(LSM303DLHC_I2C, DeviceAddr, I2C_Direction_Transmitter);
  
  while (!I2C_CheckEvent(LSM303DLHC_I2C,I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
  {
    if (LSM303DLHC_Timeout-- == 0)
    {
      I2C_ClearFlag(LSM303DLHC_I2C,I2C_FLAG_BUSY|I2C_FLAG_AF);
      goto restart;
    } 
  }
  /* Clear EV6 by setting again the PE bit */
  I2C_Cmd(LSM303DLHC_I2C, ENABLE);

  I2C_SendData(LSM303DLHC_I2C, RegisterAddr);

  /* Test on EV8 and clear it */
  LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
  while (!I2C_CheckEvent(LSM303DLHC_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
  {
    if (LSM303DLHC_Timeout-- == 0)
     return ERROR;
  }
  
  if (NumByteToRead == 0x01)
  {
    restart3:  
    /* Send START condition */
    I2C_GenerateSTART(LSM303DLHC_I2C, ENABLE);
    while (!I2C_CheckEvent(LSM303DLHC_I2C, I2C_EVENT_MASTER_MODE_SELECT));
    /* Send Slave address for read */
    I2C_Send7bitAddress(LSM303DLHC_I2C, DeviceAddr, I2C_Direction_Receiver);
    /* Wait until ADDR is set */
    LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
    while (!I2C_GetFlagStatus(LSM303DLHC_I2C, I2C_FLAG_ADDR))   
    {
      if (LSM303DLHC_Timeout-- == 0) 
      {
        I2C_ClearFlag(LSM303DLHC_I2C,I2C_FLAG_BUSY|I2C_FLAG_AF);
        goto restart3;
      }
    }
    /* Clear ACK */
    I2C_AcknowledgeConfig(LSM303DLHC_I2C, DISABLE);
    __disable_irq();
    /* Clear ADDR flag */
    temp = LSM303DLHC_I2C->SR2;
    /* Program the STOP */
    I2C_GenerateSTOP(LSM303DLHC_I2C, ENABLE);
    __enable_irq();
    while ((I2C_GetLastEvent(LSM303DLHC_I2C) & 0x0040) != 0x000040); /* Poll on RxNE */
    /* Read the data */
    *pBuffer = I2C_ReceiveData(LSM303DLHC_I2C);
    /* Make sure that the STOP bit is cleared by Hardware before CR1 write access */
    while ((LSM303DLHC_I2C->CR1&0x200) == 0x200);
    /* Enable Acknowledgement to be ready for another reception */
    I2C_AcknowledgeConfig(LSM303DLHC_I2C, ENABLE);

    return SUCCESS;
  }
  else
    if(NumByteToRead == 0x02)
    {
      restart4:     
      /* Send START condition */
      I2C_GenerateSTART(LSM303DLHC_I2C, ENABLE);
      while (!I2C_CheckEvent(LSM303DLHC_I2C, I2C_EVENT_MASTER_MODE_SELECT));
      /* Send EEPROM address for read */
      I2C_Send7bitAddress(LSM303DLHC_I2C, DeviceAddr, I2C_Direction_Receiver);
      LSM303DLHC_I2C->CR1 = 0xC01; /* ACK=1; POS =1 */
      LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
      while (!I2C_GetFlagStatus(LSM303DLHC_I2C, I2C_FLAG_ADDR))
      {
        if (LSM303DLHC_Timeout-- == 0) 
        {
          I2C_ClearFlag(LSM303DLHC_I2C,I2C_FLAG_BUSY|I2C_FLAG_AF);
          goto restart4;     
        }         
      }
      __disable_irq();
      /* Clear ADDR */
      temp = LSM303DLHC_I2C->SR2;
      /* Disable ACK */
      I2C_AcknowledgeConfig(LSM303DLHC_I2C, DISABLE);
      __enable_irq();
      while ((I2C_GetLastEvent(LSM303DLHC_I2C) & 0x0004) != 0x00004); /* Poll on BTF */
       __disable_irq();
      /* Program the STOP */
      I2C_GenerateSTOP(LSM303DLHC_I2C, ENABLE);
      /* Read first data */
      *pBuffer = LSM303DLHC_I2C->DR;
      pBuffer++;
      /* Read second data */
      *pBuffer = LSM303DLHC_I2C->DR;
      __enable_irq();
      LSM303DLHC_I2C->CR1 = 0x0401; /* POS = 0, ACK = 1, PE = 1 */
      
      return SUCCESS;
    }
  else
  {
restart2:
    LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
    /* Send START condition */
    I2C_GenerateSTART(LSM303DLHC_I2C, ENABLE);
    /* Test on EV5 and clear it */
    while (!I2C_CheckEvent(LSM303DLHC_I2C, I2C_EVENT_MASTER_MODE_SELECT))
    {
      if (LSM303DLHC_Timeout-- == 0) return ERROR;
    }
    LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
    /* Send slave address for read */
    I2C_Send7bitAddress(LSM303DLHC_I2C,  DeviceAddr, I2C_Direction_Receiver);
    while (!I2C_CheckEvent(LSM303DLHC_I2C, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
    {
      
      if (LSM303DLHC_Timeout-- == 0) 
      {
        I2C_ClearFlag(LSM303DLHC_I2C,I2C_FLAG_BUSY|I2C_FLAG_AF);
        goto restart2;
      }
    }
  
    /* While there is data to be read; here the safe procedure is implemented */
    while (NumByteToRead)
    {
  
      if (NumByteToRead != 3) /* Receive bytes from first byte until byte N-3 */
      {
        while ((I2C_GetLastEvent(LSM303DLHC_I2C) & 0x00004) != 0x000004); /* Poll on BTF */
        /* Read data */
        *pBuffer = I2C_ReceiveData(LSM303DLHC_I2C);
        pBuffer++;
        /* Decrement the read bytes counter */
        NumByteToRead--;
      }
  
      if (NumByteToRead == 3)  /* it remains to read three data: data N-2, data N-1, Data N */
      {
  
        /* Data N-2 in DR and data N -1 in shift register */
        while ((I2C_GetLastEvent(LSM303DLHC_I2C) & 0x000004) != 0x0000004); /* Poll on BTF */
        /* Clear ACK */
        I2C_AcknowledgeConfig(LSM303DLHC_I2C, DISABLE);
        __disable_irq();
        /* Read Data N-2 */
        *pBuffer = I2C_ReceiveData(LSM303DLHC_I2C);
        pBuffer++;
        /* Program the STOP */
        I2C_GenerateSTOP(LSM303DLHC_I2C, ENABLE);
        /* Read DataN-1 */
        *pBuffer = I2C_ReceiveData(LSM303DLHC_I2C);
        __enable_irq();
        pBuffer++;
        while ((I2C_GetLastEvent(LSM303DLHC_I2C) & 0x00000040) != 0x0000040); /* Poll on RxNE */
        /* Read DataN */
        *pBuffer = LSM303DLHC_I2C->DR;
        /* Reset the number of bytes to be read by master */
        NumByteToRead = 0;
      }
    }
    /* Make sure that the STOP bit is cleared by Hardware before CR1 write access */
    while ((LSM303DLHC_I2C->CR1&0x200) == 0x200);
    /* Enable Acknowledgement to be ready for another reception */
    I2C_AcknowledgeConfig(LSM303DLHC_I2C, ENABLE);
  
    return SUCCESS;
  }
}

/**
  * @brief  Writes one byte to the LSM303DLHC.
  * @param  DeviceAddr : specifies the slave address to be programmed.
  * @param  RegAddr : specifies the LSM303DLHC register to be written.
  * @param NumByteToRead: Number of bytes to be sent to the slave.
  * @param  pBuffer : pointer to the buffer  containing the data to be written to the LSM303DLH.
  * @retval LSM303DLHC Status
 */
uint16_t LSM303DLHC_Write(uint8_t DeviceAddr, uint8_t RegisterAddr,
                               uint16_t NumByteToWrite,
                               uint8_t* pBuffer)
{

  LSM303DLHC_I2C_Config();
  
  restart1:
  LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
  /* Send START condition */
  I2C_GenerateSTART(LSM303DLHC_I2C, ENABLE);
  /* Test on EV5 and clear it */
  while (!I2C_CheckEvent(LSM303DLHC_I2C, I2C_EVENT_MASTER_MODE_SELECT))
  {
    if (LSM303DLHC_Timeout-- == 0) return ERROR;
  }
  /* Send slave address for write */
  I2C_Send7bitAddress(LSM303DLHC_I2C, DeviceAddr, I2C_Direction_Transmitter);

  LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
  /* Test on EV6 and clear it */
  while (!I2C_CheckEvent(LSM303DLHC_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
  {
    
    if (LSM303DLHC_Timeout-- == 0) 
    {
      I2C_ClearFlag(LSM303DLHC_I2C,I2C_FLAG_BUSY|I2C_FLAG_AF);
      goto restart1;
    }
  }

  LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;

  /* Transmit the first address for r/w operations */
  I2C_SendData(LSM303DLHC_I2C, RegisterAddr);

  /* Test on EV8 and clear it */
  while (!I2C_CheckEvent(LSM303DLHC_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
  {
    if (LSM303DLHC_Timeout-- == 0)
      return ERROR;
  }
  if (NumByteToWrite == 0x01)
  {
    LSM303DLHC_Timeout = LSM303DLHC_LONG_TIMEOUT;
    /* Prepare the register value to be sent */
    I2C_SendData(LSM303DLHC_I2C, *pBuffer);

    /* Test on EV8 and clear it */
    while (!I2C_CheckEvent(LSM303DLHC_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
    {
      if (LSM303DLHC_Timeout-- == 0)
        return ERROR;
    }

    /* End the configuration sequence */
    I2C_GenerateSTOP(LSM303DLHC_I2C, ENABLE);
    return SUCCESS;
  }
  I2C_SendData(LSM303DLHC_I2C, *pBuffer);
  pBuffer++;
  NumByteToWrite--;
  /* While there is data to be written */
  while (NumByteToWrite--)
  {
    while ((I2C_GetLastEvent(LSM303DLHC_I2C) & 0x04) != 0x04);  /* Poll on BTF */
    /* Send the current byte */
    I2C_SendData(LSM303DLHC_I2C, *pBuffer);
    /* Point to the next byte to be written */
    pBuffer++;

